[
  {
    "name": "ZUS All Day Cup 500ml (17oz)",
    "price": "RM79.00",
    "description": "Refreshed colours for your refreshments. Ready to paint the way you drink with splashes of colours to your all-day routine of sipping on quality brew? Experience effortless style with endless combinations of our All Day Cup – now in extended colours. Choose what screams you and accessorise with the ideal drinking accessory. Available in Creamy Beige, Fresh Mint, Blue Wave, Fuzz Peach, Cherry Blossom. It’s best for hot or iced – this one’s for All Day, everyday. Trust us, your current tumbler will seem boring after this.",
    "features": [
      "Endless Combos of lids and tumbler bodies to suit personal style",
      "Keep Hot or Cold up to 16 Hours via double-walled vacuum insulation (heat retention >50°C ~12h, cold retention <10°C ~16h)",
      "Dual-Purpose Lid for hot morning beverages or iced drinks later in the day",
      "Leak-Proof Lid for spill-free transport",
      "Bring-Your-ZUS-Tumbler Program: 10% off handcrafted drinks via ZUS App when using your tumbler (*T&Cs apply)",
      "BPA-Free",
      "Material: Stainless Steel (inner & outer body: SUS304)",
      "Lid Material: PP & Silicone",
      "Lightweight ~290g, dimensions: height 17.6cm; top Ø 9.0cm; bottom Ø 7.0cm",
      "Care warnings: hand-wash only (no dishwasher/dryer), do not microwave, avoid dry ice or carbonated drinks, avoid strong acidic/alkaline liquids, do not overfill; avoid using straw with hot beverages to prevent scalding"
    ],
    "url": "https://shop.zuscoffee.com/products/zus-all-day-cup-500ml-17oz"
  },
  {
    "name": "ZUS All-Can Tumbler 600ml (20oz)",
    "price": "RM105.00",
    "description": "Dive into any sip-tuation with the all-new ZUS All-Can Tumbler, now more versatile than ever in Thunder Blue and Stainless Steel. Featuring interchangeable lids, use the “Screw On” lid for your hot Americano at work in the morning, and the “Flip Top” lid for easy hydration at the gym in the evening. Whether you’re trapped in a jungle or an office, All-Can is with you through it all.",
    "features": [
      "Interchangeable lids: Screw-On lid (for hot drinks) and Flip-Top / straw lid (for cold hydration)",
      "Double-wall vacuum insulation: keeps drinks hot (>60°C) or cold (<8°C) for up to 6 hours",
      "BPA-Free materials",
      "Bring-Your-ZUS-Tumbler Program: 10% off handcrafted drinks via ZUS App when using the tumbler (T&Cs apply)",
      "Material details: Screw-On Lid is PP, SUS201 stainless steel & silicone; Straw (Flip-Top) Lid is PP, PPS, PE & silicone",
      "Weight: ~320g; Height: 23.0cm; Diameter: 7.3cm"
    ],
    "url": "https://shop.zuscoffee.com/products/zus-all-can-tumbler-600ml-20oz"
  },
  {
    "name": "ZUS OG Ceramic Mug (16oz)",
    "price": "RM39.00",
    "description": "Designed for your cozy moments, our high-quality ceramic mug blends style and practicality effortlessly with an ergonomic handle that makes every sip a comfortable experience. Available in 3 colours: Thunder Blue, Space Black, and Cloud White. Hot & Cold Friendly, Easy Grip, Microwave & Dishwasher Safe.",
    "features": [
      "Capacity: 470ml / 16oz",
      "Material: Ceramic",
      "Dimensions: Top Diameter: 10cm; Bottom Diameter: 8.7cm; Height: 8.9cm; Weight: ~375g",
      "Ergonomic handle for comfortable grip (“Easy Grip”)",
      "Suitable for both hot and cold beverages (“Hot & Cold Friendly”)",
      "Microwave-safe and dishwasher-safe",
      "Available colours: Thunder Blue, Space Black, Cloud White"
    ],
    "url": "https://shop.zuscoffee.com/products/zus-og-ceramic-mug-16oz"
  },
  {
    "name": "ZUS OG Cup 2.0 With Screw-On Lid 500ml (17oz)",
    "price": "RM79.00",
    "description": "Our best-selling drinkware now comes with a twist. Experience OG Cup 2.0 with a Screw-On Lid for the ultimate leak-proof cup that comes with ceramic interior that preserves flavours better, allowing you to taste every note in your daily brew. Have a true ZUS Coffee experience—now embodied in our OG colours. Available in Thunder Blue, Space Black, Lucky Pink.",
    "features": [
      "Screw-On Lid providing leak-proof, mess-free drinking experience",
      "Ceramic interior/coating to preserve flavor, sophistication & durability",
      "Dual-purpose lid: sip opening and straw hole options",
      "Anti-slip base ensures stability on surfaces",
      "Hot & Cold Friendly: retains heat and cold (approx hot up to 8–10h; cold up to 12h)",
      "BPA-Free materials",
      "Bring-Your-ZUS-Tumbler Program: 10% off handcrafted drinks via ZUS App when you use your tumbler (T&Cs apply)",
      "Materials: Internal is SUS304 stainless steel, External is SUS201 stainless steel, Lid is Acrylonitrile Styrene (AS), Polypropylene (PP), Silicone, Anti-slip mat is Silicone",
      "Dimensions & weight: Oral Diameter: 8.8cm, Bottom Diameter: 7.2cm, Height: 17.5cm, Weight: ~306g"
    ],
    "url": "https://shop.zuscoffee.com/products/zus-og-cup-2-0-with-screw-on-lid"
  },
  {
    "name": "ZUS Frozee Cold Cup 650ml (22oz)",
    "price": "RM55.00",
    "description": "The perfect cup for frappe-lovers galore. Spill-Proof Seal offers a hassle-free drinking experience. Reusable Straw to reduce waste and sip sustainably. Brrr, feeling cold? Embrace the chill with Frozee Cold Cup that now comes in fresh new colour options! It’s our most loved icy drink companion and it’s the best tumbler for frappe-lovers. Available colours: Frost White, Frost Pink, Frost Green, Frost Peach.",
    "features": [
      "Frappe-able: perfect for frappe-lovers",
      "Spill-Proof Seal: offers hassle-free drinking experience",
      "Reusable Straw: reduce waste and sip sustainably",
      "Double-Wall: slows condensation",
      "Bring-Your-ZUS-Tumbler Program: 10% off handcrafted drinks via ZUS App, when using this tumbler (T&Cs apply)",
      "Volume: 650ml / 22oz",
      "Dimensions: Diameter: 10.8cm; Height: 21cm; Length/Width: 11cm; Weight: ~237g",
      "Materials: Body and Lid are Acrylonitrile Styrene (AS), Straw is Polypropylene (PP)"
    ],
    "url": "https://shop.zuscoffee.com/products/zus-frozee-cold-cup-650ml-22oz"
  }
]